UNIVERSITY_HISTORY = ('Впервые Кубанский государственный университет был открыт в Краснодаре 5 (19 по старому календарю)'
                      ' сентября 1920 года. Его первым избранным ректором стал бывший генерал царской армии, крупный ученый-историк, специалист по древнерусской палеографии Никандр Александрович Маркс. В том же сентябре 1920 года был создан и Институт народного образования. Голод и финансовый кризис в Советской России привели к упразднению многих вузов, в том числе и Кубанского госуниверситета. Студенты и преподаватели университета перешли в единственный сохраненный вуз – Институт народного образования, который был переименован в Кубанский высший педагогический институт.\n\n'
'19 сентября 1924 года постановлением Совнаркома РСФСР Кубанский высший педагогический институт был утвержден в числе других педагогических институтов страны, находившихся на бюджетном финансировании. В нем было создано шесть учебных отделений. В 1931 году временно он был переименован в Кубанский агрономический педагогический институт, в 1933 году – в Краснодарский государственный педагогический и учительский институт им. 15-летия ВЛКСМ. В конце 40-х годов вуз уже носил официальное название Краснодарский государственный педагогический институт им. 15-летия ВЛКСМ. 18 февраля 1970 года Краснодарский государственный педагогический институт был преобразован в Кубанский государственный университет.\n\n'
'По прошествии 12 лет, в 1982 году, комиссия ЦК КПСС, анализировавшая деятельность вуза, дала заключение: вуз недалеко ушел от уровня пединститута. Желание опровергнуть такую оценку, реализовать свой потенциал и доказать состоятельность университета заставило коллектив университета искать свой путь стремительного развития. Он был найден в идее совершенствования учебного процесса на основе опережающего развития науки, укрепления связей с производством, заимствование опыта МГУ, ЛГУ, АН СССР. Коллектив вуза во главе с избранным в 1982 году ректором Владимиром Андреевичем Бабешко начал преобразование университета.\n\n')
UNIVERSIYU_HYSTORY2 =('Вузу была оказана солидная материально-техническая помощь, позволившая включиться коллективу в серьезные научные исследования. Среди приглашенных профессоров много выпускников МГУ, ЛГУ, НГУ, РГУ и других известных вузов. Наличие в то время в Краснодаре больших оборонных заводов в значительной степени предопределило тематику вуза, вступившего в ХНО. Министр образования СССР И.Ф.Образцов, президент Академии наук СССР Г.И.Марчук, ряд руководителей крупных отраслей побывали в университете с визитами. Вуз уверенно встал на рельсы быстрого развития, почувствовал свои возможности, и к концу 80-х годов его научная тематика относилась к категории важнейшей по ряду направлений. Например, по мембранным технологиям Кубанский госуниверситет был головным учреждением при Госкомитете СССР по науке и технике.'
'В 1991 году рухнула экономика, развалился Союз, страна изменилась до неузнаваемости. Но не изменились в вузе люди. Мгновенное исчезновение заказов на научные исследования побудили ученых вуза формировать новые научные направления в соответствии с требованиями рынка. В этом процессе ученым значительно помогли научные заделы высокого уровня и усовершенствование технических средств. Все это позволило КубГУ найти свою нишу и в новых условиях.\n\n'
'Кубанский государственный университет сегодня – это признанный в стране и мире крупный образовательный и научный комплекс. В 2002 году Кубанский госуниверситет награжден Российско-Швейцарским бизнес-клубом золотой медалью за безупречную деловую репутацию, а в 2004 и 2005 годах вошел в сотню лучших вузов России и отмечен золотой медалью «Европейское качество».\n\n'
'В 2009 году, согласно рейтингу независимого рейтингового агентства «РейтОР», Кубанский государственный университет вошел в число лучших университетов мира. КубГУ занял 314 место в мире, став 10-м среди российских вузов и опередив все учебные заведения Южного федерального округа. \n\n'
'В 2018 году британская компания QS подвела итоги международного рейтинга вузов «Развивающаяся Европа и Центральная Азия 2017/18». Россию представили 97 российских университетов, в число лучших вошел и Кубанский государственный университет – единственный из вузов края.')


FACULTY_ABOUT = '''
Факультет готовит лучших в регионе программистов, специалистов в области компьютерных технологий и прикладной математики. Выпускники факультета работают в администрациях Краснодарского края и города Краснодара, в районных администрациях, в силовых структурах (ФСБ, МВД, прокуратуре), в судах, в вузах города и края (КубГУ, КубГАУ, КубГТУ, КубГМУ), в государственных и коммерческих банках («Уралсиб банк», «Сбербанк», «Кубань-кредит», «Альфа-банк», «Райффайзен банк»), в фирмах ОАО «Филип Моррис Кубань», ООО «НТЦ Сонар-плюс», ООО «Газпром межрегионгаз Краснодар», ПАО «НК Роснефть-Кубаньнефтепродукт», ПАО «МТС», ОАО «МегаФон», АО «Тандер», ООО «Портал-Юг», АО «Nexign» (бывш. «ПЕТЕР-СЕРВИС»), ООО «DSSL», ЗАО «НИПИ ИнжГео», ОАО «НПО Промавтоматика», в торговых центрах и сетях супермаркетов, в корпорации ZTE и в других отечественных и зарубежных организациях, учреждениях и фирмах. Многие организации участвуют в конкурсе по приглашению на работу лучших выпускников факультета.

На факультете компьютерных технологий и прикладной математики подготовку ведут высококвалифицированные специалисты: академик РАН, 10 докторов наук, 34 кандидата наук. Студенты факультета работают в 9 современных компьютерных классах и Интернет-центре. Ежегодно более 60% выпускников факультета компьютерных технологий и прикладной математики поступают в магистратуру и аспирантуру. На факультете учатся студенты стипендиаты Президента и Правительства РФ, Администрации края, фондов Потанина, фонда "Вольное дело".

Ученые факультета компьютерных технологий и прикладной математики принимают участие во многих научных конференциях в России, ближнем и дальнем зарубежье. Объем научных исследований, проведенных на факультете только за последние 5 лет составил более 200 миллионов рублей. Это международные программы, федеральные программы, гранты Министерства Образования РФ и РФФИ, гранты различных Российских и международных фондов. В рамках ведущихся на факультете научных исследований за последние 5 лет преподавателями издано 35 учебно-методических пособий и опубликовано более 500 научных статей. Доклады профессора В.А. Бабешко, доктора физико-математических наук Е.В. Глушкова и других ведущих ученых были представлены на международных конференциях.

В 2002 году лауреатами Государственной премии РФ в области науки и техники стал ученый факультета компьютерных технологий и прикладной математики Кубанского государственного университета: заведующий кафедрой математического моделирования, академик РАН В.А. Бабешко.
'''

VK_URL = 'https://vk.com/fctandam'

START_TEXT = '''
Привет, {username}!\n
Это бот для абитуриента магистратуры Факультета Компьютерных Технологий и Прикладной Математики.\n
Здесь ты можешь выбрать подходящее тебе направление на основе нашего теста, а также узнать больше о факультете и университете\n\n
'''
START_TEXT_TWO = 'Для начала предлагаю пройти тест, а потом ты сможешь подробнее ознакомиться с нашим факультетом.'

TEST_START_TEXT = f'Итак, для начала теста необходимо подтвердить, что ты согласен(согласна) на обработку результатов теста для улучшения будущих результатов, запишем твои ответы и юзернейм, а потом спросим, поступил ли ты и куда'

TEST_NO_CONFIRM = 'Чтобы воспользоваться тестом, необходимо согласиться на условия обработки данных, но если ты передумал, то можешь это сделать сейчас😀'

ADMIN_CREATED = 'Пользователь с id {tg_id} теперь администратор'
ADMIN_TO_CREATE = 'Напишите id пользователя, которого хотите сделать администратором'

QUESTION_TO_CREATE = 'Напишите текст вопроса для его добавления'
ANSWER_TO_CREATE = 'Напишите текст варианта ответа на вопрос выше'
WEIGHTS_TO_CREATE = 'Напишите веса, которые будут учитываться при финальном результате в формате 0.1;0.1;0.2 и т.д., вес может быть не больше 1\nПорядок весов для каждого направления 01.04.02(КИТ);01.04.02(КПМ);01.04.02(КММ);02.04.02;09.04.02'
QUESTION_CREATED = 'Ваш вопрос добавлен в тест'
QUESTIONS_ADDED = 'Все вопросы добавлены'

RESULT = 'Вам больше всего подходит {speciality}'

RESTART = 'Начните тест заново'

FORM_OF_TRAINING = 'Выберите направление:'

FOCUS = 'Выберите направленность:'

ABITUR_INFO = 'Абитуриентам КубГУ о ФКТиПМ'

APPLIVANT_INFO = ('Здесь ты можешь узнать о нашем факультете подробнее:'
                  'https://www.youtube.com/watch?v=RuediB8J7Bw')

CAPTION_MAT_ECO = ('Окончив профиль "Математические и информационные технологии в цифровой экономике"'
                   ' на факультете компьютерных технологий и прикладной математики ты сможешь '
                   'стать:\n\n'
                    '- Педагогом профессионального обучения, профессионального образования и дополнительного'
                   ' профессионального образования\n'
                   '- Работать в образовании и науке\n'
                   '- Работать в информационных и коммуникационных технологиях\n'
                   '- Программистом\n'
                   '- Руководителем разработки программного обеспечения\n'
                   '- Системным аналитиком')

PLAN = 'Учебный план'

PROSPECTS = 'Перспективы развития'

TEST = 'Пройти тест'

CAPTION_MAT_MOD = ('Окончив профиль "Математическое моделирование в естествознании и технологиях"'
                   ' на факультете компьютерных технологий и прикладной математики ты сможешь '
                   'стать:\n\n'
                    '- Педагогом профессионального обучения, профессионального образования и дополнительного'
                   ' профессионального образования\n'
                   '- Работать в образовании и науке\n'
                   '- Работать в информационных и коммуникационных технологиях\n'
                   '- Программистом\n'
                   '- Руководителем разработки программного обеспечения\n'
                   '- Системным аналитиком')

CAPTION_TEXNOL = ('Окончив профиль "Технологии программирования и разработки информационно-коммуникационных систем"'
                   ' на факультете компьютерных технологий и прикладной математики ты сможешь '
                   'стать:\n\n'
                    '- Педагогом профессионального обучения, профессионального образования и дополнительного'
                   ' профессионального образования\n'
                   '- Работать в образовании и науке\n'
                   '- Работать в информационных и коммуникационных технологиях\n'
                   '- Программистом\n'
                   '- Руководителем разработки программного обеспечения\n'
                   '- Системным аналитиком')

CAPTION_FUNDAM = ('Окончив направление "02.04.02 Фундаментальная информатика и информационные технологии"'
                   ' на факультете компьютерных технологий и прикладной математики ты сможешь '
                   'стать:\n\n'
                  '- Специалистом по научно-исследовательским и опытно-конструкторским разработкам\n'
                   '- Сквозные виды профессиональной деятельности в промышленности\n'
                   '- Работать в информационных и коммуникационных технологиях\n'
                   '- Программистом\n'
                   '- Руководителем разработки программного обеспечения\n'
                   '- Системным аналитиком')

CAPTION_INFO_SYS = ('Окончив направление "09.04.02 Информационные системы и технологии"'
                   ' на факультете компьютерных технологий и прикладной математики ты сможешь '
                   'стать:\n\n'
                  '- Специалистом по научно-исследовательским и опытно-конструкторским разработкам\n'
                    '- Специалистом по большим данным\n'
                    '- Менеджером по информационным технологиям\n'
                    '- Руководителем разработки программного обеспечения\n'
                    '- Руководителем проектом в области информационных технологий\n'
                   '- Сквозные виды профессиональной деятельности в промышленности\n'
                   '- Работать в информационных и коммуникационных технологиях\n'
                   '- Программистом\n'
                   '- Руководителем разработки программного обеспечения\n'
                   '- Системным аналитиком')

PLAN_STR = 'Учебный план'

COURCE = 'Выберите семестр:'

OBJECTS = 'Выберите предмет:'

SPONSORS = 'С нами сотрудничают'

SOV_TEXT = ('Аккредитованная ИТ–компания финансовой Группы Совкомбанк.\n\n'
            '- Создаём сервисы и приложения, которыми пользуются миллионы людей и мы сами.\n'
            '- Обеспечиваем отличные условия - заботимся о здоровье, комфорте и личностном росте наших сотрудников.')

KUB_TEXT = ('КБ «Кубань Кредит» — один из самых активно развивающихся универсальных банков Краснодарского края, создающий удобные, доступные, современные продукты и сервисы для клиентов.\n\n'
            'IT Департамент Банка функционирует как внутренняя лаборатория, постоянно генерирующая необходимые изменения для решения насущных задач цифровизации.')

CARX_TEXT = ('Carx Technologies - издатель и разработчик видеоигр со штаб-квартирой в Краснодаре и отделением в Москве.\n'
             'Создаем детально продуманные гоночные игры! ...\n\n'
             'Мы часто общаемся со своими игроками. И после этих разговоров получаем очень полезный feedback о том, что они хотели бы добавить в игру.')

PORT_TEXT = ('Компания "Портал-Юг" - ведущий системный интегратор ЮФО с географией проектов по всей России.\n\n'
             'Мы специализируемся на оказании профессиональных ИТ-услуг: подборе и поставке лицензионного ПО, технической поддержке, ИТ-аутсорсинге, внедрении инфраструктурных решений, объединенных коммуникаций, систем электронного документооборота, программно-аппаратных средств информационной безопасности, предоставлении комплексных решений автоматизации бизнеса, обучении и сертификации')

TIN_TEXT = ('Тинькофф — технологическая компания с банковской лицензией.\n\n'
            'Примерно 70% сотрудников штаб-квартиры — IT-специалисты, которые каждый день создают лучшие цифровые продукты в России. Нейросети и роботы')

MED_TEXT = ('МедРокет (ООО «МедРейтинг») — платформа IT-решений для медицины.\n\n'
            'Компания выпускает современные IT-проекты для медицины с 2011 года.\n'
            'Самый известный из них — «ПроДокторов», один из крупнейших сайтов отзывов о врачах и клиниках в России.')

MAG_TEXT = ('Магнит — это сеть из почти 29 тысяч розничных магазинов по всей России и за рубежом.\n\n'
            'Чтобы товары вовремя попадали на полки, а магазины без сбоев обслуживали миллионы покупателей, нужна сложная IT‑система, которую развивает Magnit Tech.')

BIL_TEXT = ('Сегодня билайн — это в первую очередь технологичная компания, чутко реагирующая на потребности рынка и людей.\n\n'
            'Мы активно используем ИИ-технологии и Big Data как для решения задач собственного бизнеса, так и для социально значимых проектов')